{"keras_version": "1.2.2", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "cropping": [[70, 24], [0, 0]], "name": "cropping2d_1", "trainable": true, "input_dtype": "float32"}, "class_name": "Cropping2D"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000C\u0000\u0000\u0000s\u001f\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0004\u0000\u0083\u0002\u0000S)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9 \u0000\u0000\u0000\u00e9\u00a0\u0000\u0000\u0000)\u0002r\u0002\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002r\u0005\u0000\u0000\u0000\u00da\u0002tf\u00a9\u0000r\b\u0000\u0000\u0000\u00fa\u001e<ipython-input-9-39fec69ac8d5>\u00da\u0006resize\b\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001\f\u0001", null, null], "trainable": true, "function_type": "lambda", "name": "lambda_1", "output_shape_type": "raw", "arguments": {}, "output_shape": null}, "class_name": "Lambda"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0o@g\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-9-39fec69ac8d5>\u00da\b<lambda>\u0011\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "trainable": true, "function_type": "lambda", "name": "lambda_2", "output_shape_type": "raw", "arguments": {}, "output_shape": null}, "class_name": "Lambda"}, {"config": {"nb_col": 8, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "b_regularizer": null, "subsample": [4, 4], "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "nb_filter": 16, "nb_row": 8, "activation": "linear", "W_constraint": null, "name": "convolution2d_1"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 5, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "b_regularizer": null, "subsample": [2, 2], "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "nb_filter": 32, "nb_row": 5, "activation": "linear", "W_constraint": null, "name": "convolution2d_2"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 5, "W_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "border_mode": "same", "b_regularizer": null, "subsample": [2, 2], "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "nb_filter": 64, "nb_row": 5, "activation": "linear", "W_constraint": null, "name": "convolution2d_3"}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_1", "output_dim": 512, "activation": "linear", "input_dim": 1280, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_2", "output_dim": 1, "activation": "linear", "input_dim": 512, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "bias": true, "activity_regularizer": null, "b_constraint": null, "trainable": true, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}